Repository: kholoud452/SchoolProject
Catalog: SchoolProject/SchoolProject.Core/SharedResource/SharedResources.*.resx
Languages: ar

source: Algorithm is wrong
ar: خطأ في خوارزمية التشفير

source: Bad Request
ar: فشل التحميل

# Created
source: Created Successfully
ar: تم الاضافة بنجاح

source: Deleted
ar: تم الحذف بنجاح

source: Department Is Not Exist
ar: هذا القسم ليس موجود

source: Email Is Already Exist
ar: البريد الالكنروني موجود مسبقا

source: Email Is Not Exist
ar: البريد الالكتروني ليس موجود

source: Faild To Add User
ar: حدث خطا اثناء اضافة المستخدم

# FaildToDeleteUser
source: Faild To Delete This User
ar: حدث خطا اثناء حذف المستخدم

# FaildToUpdateUser
source: Faild To Update The Data Of User
ar: فشل تحديث بيانات المستخدم

# FailedToChangePass
source: Failed To Change Password
ar: فشل تحديث كلمة السر

source: No Refresh Token
ar: لا يوجد رمز تنشيط

# NotEmpty
source: Field must not be empty
ar: لا يجب أن يكون الحقل فارغًا

source: Not Found
ar: هذا العنصر غير متوفر

# NotNull
source: Field must not be null
ar: لا يجب أن يكون الجقل فارغًا

# PassChangedSuccessfuly
source: Password Changed Successfuly
ar: تم تغيير كلمة السر بنجاح

# PassNotMatchConfirmPass
source: Password and Confirm Password are not Matches
ar: كلمة السر و تاكيد كلمة السر ليسا متشابهين

# ProblemWithNameOrPass
source: Error With UserName Or Password
ar: خطا في اسم المستخدم او كلمة السر

# Required
source: This Field is Required
ar: هذا الحقل مطلوب

source: Refresh Token is Expired
ar: انتهي رمز التنشيط الذي تستخدمه

source: Success
ar: تم العملية بنجاح

source: Token is not Expired
ar: رمز الوصول غير منتهي

# UnAuthorized
source: You are not Authorized to access this resources
ar: غير مصرح به

# UnprocessableEntity
source: There are Validation Error Or Syntax Error
ar: غير قابل للمعالجة

# Updated
source: Updated Successfully
ar: تم التعديل بنجاح

source: UserName Is Already Exist
ar: الاسم موجود مسبقا

source: UserName Is Not Exist
ar: الاسم ليس موجود

# UserNotFound
source: User Is Not Found
ar: هذا المستخدم ليس موجود

source: Token is Expired
ar: رمز الوصول منتهي

source: Role Name Is Not Found
ar: هذه الصلاحية غير موجودة

# RoleNameIsExist
source: Role Name Is Already Exist
ar: هذه الصلاحية موجودة بالفعل

source: Failed To Add Role
ar: فشل في اضافة الصلاحية

source: RoleAddedSuccefully
ar: تم اضافة الصلاحية بنجاح

source: Role Updated Successfully
ar: تم تعديل الصلاحية بنجاح

source: Role Is Not Found
ar: الصلاحية ليست موجودة

# RoleIsUsed
source: Role Is Used , You should deal with users with this role
ar: هذه الصلاحية مستخدمة و يجب التعامل مع المستخدمين الذين لهم هذه الصلاحية

# FailedToRemoveRoles
source: Failed To Remove Old Roles
ar: فشل في مسح الصلاحيات القديمة

source: Failed To Update Roles
ar: فشل في تحديث الصلاحيات

source: Failed To Add New Roles
ar: فشل في اضافة الصلاحيات الجديدة

source: Failed To Remove Claims
ar: فشل في إزالة المطالبات

source: Failed To Update Claims
ar: فشل تحديث المطالبات

source: Failed To Add New Claims
ar: فشل في إضافة مطالبات جديدة

source: Claims Updated Successfully
ar: تم تحديث المطالبات بنجاح

source: Failed To Send Email
ar: خطا في ارسال البريد الاكتروني

source: Email Not Confirmed
ar: لم يتم تاكيد البريد الالكتروني

source: Try To Register Again
ar: حاول التسجيل مرة اخري

# ErrorInConfirmEmail
source: Error In Confirm The Email
ar: حدث خطا اثناء تاكيد البريد الاكتروني

# ConfirmEmailisCompleted
source: Confirm Email operation is Completed
ar: تمت عملية تاكيد البريد الاكتروني

source: Failed To Send User Code
ar: فشل في ارسال الكود

# TryAgain
source: Error, Try Again
ar: حدث خطا اعد المحاولة

source: Invalid Code
ar: الكود الذي ادخلته غير صحيح

source: Instructor Is Not Exist
ar: المعلم غير موجود

# InstructorIsAlreadyManagerForDept
source: Instructor Is Already Manager For Department
ar: هذا المعلم يمسك قسم بالفعل

source: Department Not Found Or Deleted
ar: القسم غير موجود او تم حذفه

source: Student Not Found Or Deleted
ar: هذا الطالب غير موجود او تم حذفه بالفعل
